---
kind: enumMember
id: F:Autodesk.Revit.DB.SolidCurveIntersectionMode.CurveSegmentsOutside
enum: Autodesk.Revit.DB.SolidCurveIntersectionMode
source: html/a5221b6d-c361-3380-a87c-29e9abe33706.htm
---
# Autodesk.Revit.DB.SolidCurveIntersectionMode.CurveSegmentsOutside

The results will include only curve segments outside the solid volume.